contact.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Connect</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Connect</h1>
</header><p>
I'd genuinely like to hear from you — to swap ideas, explore a collaboration, or
just say hello. I reply within ~1 business day (UTC+8).
</p>
<div id="outline-container-orge789e99" class="outline-2">
<h2 id="orge789e99">Ways to reach me</h2>
<div class="outline-text-2" id="text-orge789e99">
<ul class="org-ul">
<li><b>Email</b>: <a href="mailto:dev@jingtao.net">dev@jingtao.net</a> — the best way to start.</li>
<li><b>Code</b>: <a href="https://github.com/jingtao-net">github.com/jingtao-net</a> and <a href="https://github.com/jingtaozf">github.com/jingtaozf</a> (my authored projects).</li>
<li><b>Book a call</b>: <a href="https://cal.com/jingtaoxu">cal.com/jingtaoxu</a> — if a conversation is easier.</li>
</ul>
</div>
</div>
<div id="outline-container-org0c6c9db" class="outline-2">
<h2 id="org0c6c9db">What I'm open to</h2>
<div class="outline-text-2" id="text-org0c6c9db">
<p>
No pressure, and no transaction needed to reach out. That said: I'm open to the
right long-term collaboration or full-time remote role where deep-systems
judgement and meta-programming matter. Remote, UTC+8 — overlaps US mornings and
EU afternoons. English or Chinese.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
